<!DOCTYPE html>
<html lang='es' itemscope itemtype='http://schema.org/ProfilePage'>

<head>
  <title>Roberto Chamoso: Desarrollo de p&aacute;ginas Web.</title>
  <meta charset='utf-8' />
  <meta itemprop='primaryImageOfPage' content='../img/logoRChWeb.png'/>
  <meta name='description' content='Desarrollo de p&aacute;ginas y aplicaciones moviles Web. Utilizando Html5, Css3, Javascript, Svg, Canvas. Con t&eacute;cnicas de Dise&ntilde;o Adaptable (Responsive Design).' />
  <meta name='author' content='Roberto Chamoso' />
  <meta name='web_author' content='Roberto Chamoso' />
  <meta name='designer' content='Roberto Chamoso' />
  <meta name='created' content='2014-08-15' />
  <meta name='contact' content='robchamoso@gmail' />
  <meta name='keywords' content='desarrollo web, html5, css3, javascript, canvas, responsive design, dise&ntilde;o adaptable, programaci&oacute;n web' />
  <meta name='viewport' content='width=device-width, initial-scale=1.0, user-scalable=1' />
  <meta name='HandheldFriendly' content='true'>
  <link rel='stylesheet' href='css/estilos.css' />
  <link rel='shortcut icon' href='img/favicon.ico' type='image/x-icon' />
  <link rel='schema.dcterms' href='http://purl.org/dc/terms/'>
	<script src='js/funciones.js'></script>
  <script src='js/indexjs.js'></script>
</head>

<body onload='inicio();'>
  <header id='header' class='izq'>
    <h1 itemprop="author" itemscope itemtype="http://schema.org/Person"><span class='inlineBlock'>R</span>Ch Web</h1>
    <a rel='home' href='http://www.rchweb.net' target='_blank' title='RChWeb.net'>
			<object id='logo' rel='image_src' type='image/svg+xml' data='img/logoRChWeb.svg' title='Logo de RchWeb.net' >
				<img rel='image_src' src='img/logoRChWeb.png' alt='Logo de RchWeb.net' title='Logo de RchWeb.net'/>
			</object>
    </a>
  </header>

  <nav id='nav' class='center izq'>
    <ul id='menu' class='inline botonCircular'>
      <!--li>
        <span title='Desplegar Men&uacute;'>&#9776;</span>
      </li-->
      <li class='menu'>
        <a class='trabajo' rel='section' href='#trabajo' title='mi Trabajo'>&#9786;</a>
        <p class='trabajoP'>mi Trabajo</p>
      </li>
      <li class='menu'>
        <a class='perfil' rel='section' href='#perfil' title='mi Perfil'>&#9000;</a>
        <p class='perfilP'>mi Perfil</p>
      </li>
      <li class='menu'>
        <a class='herramientas' rel='section' href='#herramientas' title='mis Herramientas'>&#9763;</a>
        <p class='herramientasP'>mis Herramientas</p>
      </li>
      <li class='menu'>
        <a class='fotografia' rel='section' href='#fotografia' title='mis Fotograf&iacute;as'>&#9836;</a>
        <p class='fotografiaP'>mis Fotograf&iacute;as</p>
      </li>
    </ul>
  </nav>

  <section id='trabajo' class='section'>
    <article>
			<h2 class='dch'>Desarrollo Web</h2>
			<div class='separador'></div>
			<p>Servicio de programaci&oacute;n Web personalizado y optimizado para satisfacer sus necesidades
					de negocio en internet.</p>
			<p>Especializado en el Desarrollo y Dise&ntilde;o Web aplicando los constantes cambios tecnol&oacute;gicos
					y tendencias en la Web.</p>
			<p>Desarrollo de p&aacute;ginas Web para cualquier dispositivo (Ordenador, Tablet o Movil) aplicando el
					Dise&ntilde;o Web Adaptable o Responsive Web Design.</p>
			<p>Desarrollo con los principales lenguajes de programaci&oacute;n y dise&ntilde;o Web:
					Html5, Css3, JavaScrit, Php y Svg.</p>
			<p>Migraci&oacute;n de p&aacute;ginas Web antiguas a las nuevas normativas de la Web (Html5 y Css3).</p>
			<p>Creaci&oacute;n de Perfil en las principales Redes Sociales.</p>
			<p>Bases de Datos MySql o noMySql (Json).</p>
			<p>Utilizaci&oacute;n de palabras clave y dar de alta en los buscadores para el mejor posicionamiento
					y rastreo de la p&aacute;gina Web.</p>
			<p>Tanto si deseas crear una nueva p&aacute;gina Web Personal, para tu Empresa o Negocio, o modificar
					tu p&aacute;gina actual, no dudes en contactar para cualquier consulta.</p>
			<div class='separador'></div>
    </article>
  </section>

  <section id='perfil' class='section'>
    <article>
			<h2>Hola, soy <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span></h2>
      <img src='img/rchamoso.png' alt='Foto de Perfil de Roberto Chamoso' title='Roberto Chamoso' itemprop="image" itemscope itemtype="http://schema.org/Person" />
      <p class='primerParrafo'>Mi trabajo es <span itemprop="makesOffer" itemscope itemtype="http://schema.org/Person">crear sitios web</span>. Soy ante todo 
          <span itemprop="jobTitle" itemscope itemtype="http://schema.org/Person">Desarrollador Web</span>
          (<span lang='en' title='Ingl&eacute;s' itemprop="jobTitle" itemscope itemtype="http://schema.org/Person">Web Developer</span>), pero 
          tambi&eacute;n tengo experiencia en <span lang='en' title='Ingl&eacute;s'>front-end</span> (el <span lang='en' title='Ingl&eacute;s'>front-end</span>
          es lo que ve en su navegador) y el <span itemprop="makesOffer" itemscope itemtype="http://schema.org/Person">Dise&ntilde;o Web Adaptable</span>
          (<span lang='en' title='Ingl&eacute;s' itemprop="makesOffer" itemscope itemtype="http://schema.org/Person">Responsive Web Design</span>).
          Aqu&iacute; puedes ver las 
          <a class='enlace' rel='nofollow' href='http://www.basekit.com.mx/basekiteca/diferencias-entre-un-desarrollador-y-un-disenador-web' target='_blank' title='abrir enlace en una pesta&ntilde;a nueva'>
            Diferencias entre un desarrollador y un dise&ntilde;ador web.
          </a></p>
      <p class='sangria'>Te animo a que sigas el siguiente enlace si deseas saber m&aacute;s sobre mi.</p>
    </article>
  </section>
    
  <section id='herramientas' class='section'>
    <article>
			<h2>Herramientas para el Desarrollo y Dise&ntilde;o Web</h2>
			<p>Semi-Blog personal creado para la consulta r&aacute;pida de algunos c&oacute;digos, herramientas
					y enlace &uacute;tiles.</p>
			<p>Dirigido principalmente a los dise&ntilde;adores y desarrolladores web y a las personas que se 
					esten iniciando en el desarrollo Web.</p>
    </article>
  </section>

  <section id='fotografia' class='section'>
    <article>
			<h2>Blog Fotogr&aacute;fico</h2>
			<p>En este blog personal comparto mis trabajos fotogr&aacute;ficos.</p>
			<p>La fotograf&iacute;a es una de mis aficiones favoritas, y cada vez que doy un paseo o viajo
					llevo mi c&aacute;mara fotogr&aacute;fica para captar esos momentos o lugares que me gustan y llaman
					mi atenci&oacute;n.</p>
			<p>Pero lo m&aacute;s importante es compartir esas impresiones con los amigos y las personas que les
					guste admirar la belleza y originalidad que capta la c&aacute;mara de un fot&oacute;grafo.</p>
			<p>Actualmente este Blog se encuentra en construcci&oacute;n, pero pueden ver algunos de mis trabajos
					en la red social de Panoramio, donde se muestran fotos de todo el mundo y principal base de datos
					fotogr&aacute;fica para Google Maps y Earth.</p>
    </article>
  </section>

  <footer id='footer'>
    <div>
      <cite>"La mejor manera de tener una buena idea es tener muchas ideas."</cite>
      <a href='http://es.wikipedia.org/wiki/Linus_Pauling' title='Informaci&oacute;n de Linus Pauling en Wikipedia'>Linus Pauling</a>
    </div>
    <div id='condiciones'>
      <a rel='section' href='#terminosCondiciones' title='mostrar terminos de las Condiciones de Uso'>Condiciones de Uso</a>
    </div>
    <div id='cookies'>
      <a rel='section' href='#politicaCookies' title='mostrar Pol&iacute;tica de Cookies'>Pol&iacute;tica de Cookies</a>
    </div>
    <div id='contacto'>
      <a rel='contact' href='mailto:robchamoso@gmail.com' target='_blank' title='contacto' itemprop="email" itemscope itemtype="http://schema.org/Person">
        <span class='inlineBlock'>&#9993; </span> 
        <span class='inlineBlock' itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span>
      </a>
    </div>
    <div itemscope itemtype='http://data-vocabulary.org/Person'>
      <a rel='home' href='http://www.rchweb.net/' target='_blank' title='RChWeb.net'>
        <img rel='image_src' src='../img/logoRChWeb.png' alt='Logo de RchWeb.net' title='Logo de RchWeb.net' />
        <time datetime='2014-08-15'>&#169; 2014</time>
      </a>
    </div>
  </footer>

  <!--aside>
    <div id='aceptarCookies'>
      <h4>Pol&iacute;tica de Cookies</h4>
      <p class='inlineBlock'>Esta web utiliza cookies de terceros para ofrecer al visitante una forma m&aacute;s c&oacute;moda y eficiente al navegar.
        Al utilizar esta web aceptas la 
        <a rel='section' href='#politicaCookies' title='mostrar Pol&iacute;tica de Cookies'>Pol&iacute;tica de Cookies.</a> 
      </p>
      <button class='inlineBlock dch' title='Continuar navegando por la web' onclick='document.getElementById("aceptarCookies").setAttribute("style","bottom:-200px;")'>Continuar</button>
    </div>
        <div class='separador'></div>
    
    <div id='terminosCondiciones' class='cajaLuz'>
      <div class='cajaLuzContenido'>
        <a class='cerrar' rel='section' href='#footer' title='cerrar'>&#10008;</a>
        <span>cerrar</span>
        <div class='contenidoFooter'>
          <h3>CONDICIONES DE USO</h3>
          <p>Las presentes condiciones son los t&eacute;rminos y condiciones con los que Usted (el Usuario) y 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> regulan el uso y
              disfrute de la web www.rchweb.net. Ser usuario de la web www.rchweb.net implica que Usted. reconoce haber le&iacute;do y aceptado las
              presentes condiciones y lo que se derive de la normativa legal aplicable en esta materia. Si Usted no est&aacute; de acuerdo con estas
              condiciones le rogamos que no contin&uacute;e usando la web de 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span>(www.rchweb.net).</p>
          <h5>OBJETO DE LA WEB</h5>
          <p>El portal www.rchweb.net proporciona el acceso a multitud de informaci&oacute;n, servicios, programas o datos en Internet
              pertenecientes a <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> o a sus licenciantes a los
              que el usuario pueda tener acceso. El usuario asume la responsabilidad del uso del portal. En cualquier caso, 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> no ser&aacute; responsable de las opiniones
              vertidas por los usuarios a trav&eacute;s de los foros, chats, u otras herramientas de participaci&oacute;n.</p>
          <h5>PROPIEDAD INTELECTUAL E INDUSTRIAL</h5>
          <p><span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> por s&iacute; o como cesionaria, es titular
              de todos los derechos de propiedad intelectual e industrial de su p&aacute;gina web, as&iacute; como de los elementos contenidos en la
              misma (a t&iacute;tulo enunciativo, im&aacute;genes, sonido, audio, v&iacute;deo, software o textos; marcas o logotipos, combinaciones
              de colores, estructura y dise&ntilde;o, selecci&oacute;n de materiales usados, software necesario para su funcionamiento, acceso y uso,
              etc.), o bien de sus licenciantes.</p>
          <p>Todos los derechos reservados. En virtud de lo dispuesto en los art&iacute;culos 8 y 32.1, p&aacute;rrafo segundo, de la Ley de Propiedad
              Intelectual, quedan expresamente prohibidas la reproducci&oacute;n, la distribuci&oacute;n y la comunicaci&oacute;n p&uacute;blica,
              incluida su modalidad de puesta a disposici&oacute;n, de la totalidad o parte de los contenidos de esta p&aacute;gina web, con fines
              comerciales, en cualquier soporte y por cualquier medio t&eacute;cnico, sin la autorizaci&oacute;n de 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span>. El usuario se compromete a respetar los
              derechos de Propiedad Intelectual e Industrial titularidad de 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span>. Podr&aacute; visualizar los elementos del
              portal e incluso imprimirlos, copiarlos y almacenarlos en el disco duro de su ordenador o en cualquier otro soporte f&iacute;sico
              siempre y cuando sea, &uacute;nica y exclusivamente, para su uso personal y privado.</p>
          <p>Las fuentes de letras y los flat-icon utilizados en esta p&aacute;gina son de libre uso.</p>
          <p>El logotipo (imagen) mostrado en la cabecera y p&iacute;e de p&aacute;gina, y las imagenes de fondo, estan registrados bajo la licencia
            <a id='licenciaEnalce' rel='license' href='http://creativecommons.org/licenses/by-nc-nd/3.0/' target='_blank' title='Licencia Creative Commons'>
              Creative Commons Reconocimiento-NoComercial-SinObraDerivada 3.0 Unported License.</a>
          </p>
          <p>Todos los nombres propios de Software, Empresas y Productos son marcas registradas y no se utilizan en este sitio con
              fines comerciales.</p>
          <p>Las fotograf&iacute;as, canciones y videos mostrados en este sitio tienen sus propios derechos de autor.</p>
          <p>Los pases de diapositivas de las fotos de Panoramio y Flickr son compartidos de acuerdo a su Pol&iacute;tica de Uso.</p>
          <p>Los videos de youtube de esta p&aacute;gina son reproducidos desde el trabajo creado y compartido por Google y usado seg&uacute;n
              los t&eacute;rminos descritos en la Licencia de Creative Commons 3.0.</p>
          <p>Las listas de reproducci&oacute;n de m&uacute;sica de MySpace y Reverbnation son reproducidas y compartidas desde los 
              respectivos sitios web bajo su Licencia de Usabilidad.</p>
          <h5>ENLACES</h5>
          <p><span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> no ejerc&eacute; ning&uacute;n tipo de control
              sobre los enlaces o hiperv&iacute;nculos hac&iacute;a otros sitios de Internet. En ning&uacute;n caso 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> asumir&aacute; responsabilidad alguna por los
              contenidos de alg&uacute;n enlace perteneciente a un sitio web ajeno, ni garantizar&aacute; la disponibilidad t&eacute;cnica, calidad,
              fiabilidad, exactitud, amplitud, veracidad, validez y constitucionalidad de cualquier material o informaci&oacute;n contenida en ninguno
              de dichos hiperv&iacute;nculos u otros sitios de Internet. Igualmente la inclusi&oacute;n de estas conexiones externas no
              implicar&aacute; ning&uacute;n tipo de asociaci&oacute;n, fusi&oacute;n o participaci&oacute;n con las entidades conectadas.</p>
          <h5>RESPONSABILIDAD</h5>
          <p><span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> no se hace responsable de los da&ntilde;os y
              perjuicios que se produzcan por fallos o malas configuraciones del software instalado en el ordenador del Usuario, fallos en la
              transmisi&oacute;n y defectos del fabricante de software. Esta web est&aacute; preparada por defecto para ser visualizada en los
              navegadores que cumplan los est&aacute;ndares web y para cualquier sistema operativo.
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> no responde de la falta de visualizaci&oacute;n
              de informaci&oacute;n relevante que pudieran producirse en otro tipo de combinaci&oacute;n posible de navegadores y/o sistemas operativos.</p>
          <p>Usted es el &uacute;nico responsable de lo que suceda en su propio Equipo, y deber&aacute; tomar las medidas de seguridad adecuadas para
              proteger la informaci&oacute;n alojada en el mismo, para evitar p&eacute;rdidas o da&ntilde;os causados por descargas desde la Web 
              respecto a la informaci&oacute;n a la que pueda acceder el usuario a trav&eacute;s de la web, debido a las diferentes fuentes de
              obtenci&oacute;n de la misma y su proceso de grabaci&oacute;n, 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> no garantiza la correcci&oacute;n absoluta
              de la misma y por ello el Usuario no podr&aacute; exigir responsabilidad alguna por da&ntilde;os y perjuicios derivados de errores en la
              informaci&oacute;n suministrada.</p>
          <h5>MODIFICACIONES</h5>
          <p><span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span> podr&aacute; variar las presentes condiciones
              en cualquier momento, aunque no es intenci&oacute;n que sea frecuente, publicando en esta misma p&aacute;gina las fechas de las
              modificaciones y entrando en vigor de forma inmediata. Si por cambio legislativo o resoluci&oacute;n judicial deja de ser aplicable una
              parte de las presentes condiciones, dichas cl&aacute;usulas ser&aacute;n anuladas, pero las dem&aacute;s ser&aacute;n perfectamente
              v&aacute;lidas y permanecer&aacute;n en vigor. El hecho de continuar usando esta Web implica que Usted acepta estas condiciones y se
              compromete a aceptar las modificaciones realizadas en las mismas, oblig&aacute;ndose a revisar esta p&aacute;gina con frecuencia.
              En caso de no aceptar estas condiciones, no debe seguir visitando la Web de 
              <span itemprop="author" itemscope itemtype="http://schema.org/Person">Roberto Chamoso</span>(www.rchweb.net).</p>
        </div>
      </div>
    </div>

    <div id='politicaCookies' class='cajaLuz'>
      <div class='cajaLuzContenido'>
        <a rel='section' class='cerrar' href='#footer' title='cerrar'>&#10008;</a>
        <span>cerrar</span>
        <div class='contenidoFooter'>
          <h3>Pol&iacute;tica de Cookies</h3>
          <p>Se denomina cookie a un segmento de datos que son almacenados en el navegador del usuario con la finalidad de ofrecer mayor informaci&oacute;n
              al servidor web acerca de &eacute;ste, permitiendo as&iacute; recordar determinados par&aacute;metros e informaci&oacute;n sobre el usuario,
              consiguiendo una mayor personalizaci&oacute;n y an&aacute;lisis sobre el comportamiento del mismo.</p>
          <p>La cookies utilizadas en esta web son de Terceros, esto quiere decir que www.rchweb.net no utiliza cookies propias, correspondientes a las
              aplicaciones de Panoramio, Flickr, Google, Youtube, Myspace y Reverbnation. En caso de no querer recibir cookies, por favor configure su
              navegador de Internet para que las borre del disco duro de su ordenador, las bloquee o le avise en caso de instalaci&oacute;n de las mismas.
              Para continuar sin cambios en la configuraci&oacute;n de las cookies, simplemente contin&uacute;e en la p&aacute;gina web.</p>
          <h5>Tipos de Cookies</h5>
          <p>Existen diferentes tipos de cookies, las cuales pueden ser clasificadas seg&uacute;n su finalidad a la hora de obtener informaci&oacute;n
              acerca del usuario:</p>
          <ul>
            <li><span>Cookies t&eacute;cnicas:</span> Son aquellas que resultan imprescindibles para permitir al usuario la navegaci&oacute;n a
                trav&eacute;s de una p&aacute;gina web, como por ejemplo, las que permiten almacenar los datos de un pedido online.</li>
            <li><span>Cookies de personalizaci&oacute;n:</span> Este tipo permite personalizar las funciones o contenidos del sitio web en funci&oacute;n
                de los datos obtenidos del navegador. Mediante estas cookies podemos presentar un sitio web en el mismo idioma del navegador usado para
                visitar la web.</li>
            <li><span>Cookies de an&aacute;lisis:</span> Se utilizan con fines estad&iacute;sticos &uacute;nicamente. Un claro ejemplo podr&iacute;a ser
                las cookies generadas por el script de seguimiento de Google Analytics.</li>
            <li><span>Cookies publicitarias y de publicidad comportamental:</span> Son todas aquellas que tienen como objetivo mejorar la eficacia de
                los espacios publicitarios. As&iacute;, la red publicitaria de Google o los adservers incluyen este tipo de tecnolog&iacute;as para dar
                el servicio deseado a sus clientes.</li>
          </ul>
          <h5>C&oacute;mo deshabilitar las Cookies en los navegadores m&aacute;s usados</h5>
          <ul id='navegadores'>
            <li><span>Chrome:</span> Configuraci&oacute;n &#8594; Mostrar opciones avanzadas &#8594; Privacidad &#8594; Configuraci&oacute;n de
                contenido.</li>
            <li>Para m&aacute;s informaci&oacute;n, puede consultar el soporte de Google o la Ayuda del navegador.</li>
            <li><span>Internet Explorer:</span> Herramientas &#8594; Opciones de Internet &#8594; Privacidad &#8594; Configuraci&oacute;n.</li>
            <li>Para m&aacute;s informaci&oacute;n, puede consultar el soporte de Microsoft o la Ayuda del navegador.</li>
            <li><span>Firefox:</span> Herramientas &#8594; Opciones &#8594; Privacidad &#8594; Historial &#8594; Configuraci&oacute;n Personalizada.</li>
            <li>Para m&aacute;s informaci&oacute;n, puede consultar el soporte de Mozilla o la Ayuda del navegador.</li>
            <li><span>Safari:</span> Preferencias &#8594; Seguridad.</li>
            <li>Para m&aacute;s informaci&oacute;n, puede consultar el soporte de Apple o la Ayuda del navegador.</li>
          </ul>
        </div>
      </div>
    </div>
  </aside-->

</body>
</html>